app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating in ('R','PG-13'))
---
  def index
    @all_ratings = Movie.all_ratings

    #this right here is a fancy sort
    if (params[:sort] == "title")
      @movies = Movie.all.sort_by {|movie| movie.title}